export enum Role {
  SUPERADMIN = 'SUPERADMIN', // Команда розробки
  INSTITUTION_ADMIN = 'INSTITUTION_ADMIN', // Технічний адміністратор з боку ЗВО - Адміністратор ЗВО
  STUDENT = 'STUDENT', // Особа, що здобувають освіту - студент (скорочено)
  EMPLOYEE = 'EMPLOYEE', // Співробітник ЗВО
  // TEACHER = 'TEACHER',                          // Навчально-педагогічний працівник - НПП (скорочено)
  // EXPERT = 'EXPERT',                            // Експерт НАЗЯВО - "Експерт" (скорочено)
  // GUEST = 'GUEST',                              // Особа, яку не аутентифіковано в системі - Гість (скорочено)
  // Особа, що має повний, або частковий доступ до результатів - P(скорочення)
  // Член НАЗЯВО
}
